In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()

today = date.today()
today

datetime.date(2022, 1, 6)

In [2]:
format_dict = {
               'qty':'{:,}','SHARES':'{:,}','available_qty':'{:,}','volbuy':'{:,}','volsell':'{:,}','volbal':'{:,}',
               'price':'{:,.2f}','PRICE':'{:,.2f}','max_price':'{:,.2f}','min_price':'{:,.2f}',
               'buy_target':'{:,.2f}','sell_target':'{:,.2f}','fee':'{:,.2f}','vat':'{:,.2f}',
               'net':'{:,.2f}','profit':'{:,.2f}','cost':'{:,.2f}','volume':'{:,.2f}','beta':'{:,.2f}',
               'Q4':'{:,.3f}','Q3':'{:,.3f}','Q2':'{:,.3f}','Q1':'{:,.3f}','DIVIDEND':'{:,.3f}',
               'percent':'{:,.2f}%','PERCENT':'{:,.2f}%','yearly':'{:,.2f}%','pct':'{:,.2f}%',
              }

### Tables in the process

In [11]:
# Sells table in MySql portfolio database
sql = """
SELECT T.name, B.date AS buy_date, S.* FROM sells S
JOIN buys B ON S.buy_id = B.id
JOIN stocks T ON B.stock_id = T.id
ORDER BY S.id DESC
LIMIT 1"""
sells = pd.read_sql(sql, conpf)
sells.style.format(format_dict)

In [15]:
# Buys table in MySql portfolio database
names = sells['name']
name = names.to_string(index=False)

sql = """
SELECT T.name, B.* FROM buys B
JOIN stocks T ON B.stock_id = T.id
ORDER BY B.id DESC
LIMIT 1"""
print(sql)

buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

SELECT T.name, B.* FROM buys B
JOIN stocks T ON B.stock_id = T.id
ORDER BY B.id DESC
LIMIT 1

In [16]:
# Stocks table in MySql portfolio database
names = buys['name']
name = names.to_string(index=False)

sql = """
SELECT T.* FROM stocks T
WHERE name = '%s'"""
sql = sql % name
print(sql)

stocks = pd.read_sql(sql, conpf)
stocks.style.format(format_dict)

SELECT T.* FROM stocks T
WHERE name = 'EPG'

In [51]:
# Buy table in MySql stock database
names = sells['name']
name = names.to_string(index=False)

sql = """
SELECT * FROM buy
WHERE name = '%s'
"""
sql = sql % name
print(sql)

buy = pd.read_sql(sql, const)
buy.style.format(format_dict)

SELECT * FROM buy
WHERE name = 'DCC'

In [ ]:
# Dividend table in MySql stock database
names = sells['name']
name = names.to_string(index=False)

sql = """
SELECT * FROM dividend
WHERE name = '%s'
"""
sql = sql % name
print(sql)

dividend = pd.read_sql(sql, const)
dividend.style.format(format_dict)

In [ ]:
date = today.strftime('%Y-%m-%d')
date

### Sell transactions

### Begin of sell process to buy table in mysql stock database

In [27]:
sql = '''
SELECT T.name, S.* , B.net AS cost, B.qty 
FROM sells S
JOIN buys B
ON buy_id = B.id
JOIN stocks T
ON B.stock_id = T.id
WHERE S.date = '%s'
AND T.name = "DCC"
ORDER BY S.id DESC LIMIT 1
'''
sql = sql % today
sells = pd.read_sql(sql, conpf)
sells.style.format(format_dict)

In [28]:
names = sells['name']
name = names.to_string(index=False)
name

'DCC'

In [29]:
sr_qty = sells['qty']
qty_str = sr_qty.to_string(index=False)
qty = int(qty_str) * -1
qty

-40000

In [30]:
sql = """
SELECT * 
FROM buy 
WHERE name = '%s'
"""
sql = sql % name
print(sql)

buy = pd.read_sql(sql, const)
buy

SELECT *
FROM buy
WHERE name = 'DCC'

,name,date,volbuy,price,volsell,volbal,active,dividend,period,grade
0,DCC,2021-09-14,40000.0,2.9,0.0,0.0,1,0.184,4,A1

In [31]:
sqlUpd = '''
UPDATE buy
SET volbuy = volbuy + %s
WHERE name = "%s"'''
sqlUpd = sqlUpd % (qty, name)
print(sqlUpd)

rp = const.execute(sqlUpd)
rp.rowcount

UPDATE buy
SET volbuy = volbuy + -40000
WHERE name = "DCC"

1

In [32]:
sqlDel = '''
DELETE FROM buy
WHERE volbuy = 0'''
rp = const.execute(sqlDel)
rp.rowcount

1

### End of sell process to buy table in mysql stock database

### Begin of sell process to stocks table in sqlite port_lite database

In [40]:
sql = """
SELECT * 
FROM stocks 
WHERE name = '%s'
"""
sql = sql % name
print(sql)

stocks = pd.read_sql(sql, conlite)
stocks.style.format(format_dict)

SELECT *
FROM stocks
WHERE name = 'DCC'

sqlUpd = '''
UPDATE stocks
SET available_qty = available_qty + %s
WHERE name = "%s"'''
sqlUpd = sqlUpd % (qty, name)
print(sqlUpd)

rp = conlite.execute(sqlUpd)
rp.rowcount

### End of sell process to stocks table in sqlite port_lite database

### Begin of Update table dividend in mysql stock database for sells transactions

In [34]:
sql = """
SELECT * 
FROM dividend 
WHERE name = "%s" 
"""
sql = sql % name
print(sql)

dividend = pd.read_sql(sql, const)
dividend.style.format(format_dict)

SELECT *
FROM dividend
WHERE name = "DCC"

In [35]:
sqlUpd = '''
UPDATE dividend
SET shares = shares + %s
WHERE name = "%s"'''
sqlUpd = sqlUpd % (qty, name)
print(sqlUpd)

rp = const.execute(sqlUpd)
rp.rowcount

UPDATE dividend
SET shares = shares + -40000
WHERE name = "DCC"

1

In [38]:
sqlDel = """
DELETE FROM dividend
WHERE name = '%s' AND shares = 0
"""
sqlDel = sqlDel % name
print(sqlDel)

rp = const.execute(sqlDel)
rp.rowcount

SELECT *
FROM dividend
WHERE name = "DCC"

1

### End of Update table dividend in mysql stock database for sells transactions

### Buys transactions

### Begin of buy process to buy table in mysql stock database

In [44]:
sql = """
SELECT * 
FROM buy 
WHERE name = '%s'
"""
sql = sql % name
print(sql)

buy = pd.read_sql(sql, const)
buy

SELECT *
FROM buy
WHERE name = 'DCC'

Empty DataFrame
Columns: [name, date, volbuy, price, volsell, volbal, active, dividend, period, grade]
Index: []

In [47]:
new_cost = 0  # new average cost must be calculated manually beforehand

sqlUpd = '''
UPDATE buy
SET volbuy = volbuy + %s, price = %s
WHERE name = "%s"'''
sqlUpd = sqlUpd % (qty, new_cost, name)
print(sqlUpd)

UPDATE buy
SET volbuy = volbuy + -40000, price = 0
WHERE name = "DCC"

In [10]:
rp = const.execute(sqlUpd)
rp.rowcount

1

### End of buy process to buy table in mysql stock database

### Begin of buy process to stocks table in sqlite port_lite database

In [48]:
sql = """
SELECT * 
FROM stocks 
WHERE name = '%s'
"""
sql = sql % name
print(sql)

stocks = pd.read_sql(sql, conlite)
stocks.style.format(format_dict)

SELECT *
FROM stocks
WHERE name = 'DCC'

In [49]:
sqlUpd = '''
UPDATE stocks
SET available_qty = available_qty + %s
WHERE name = "%s"'''
sqlUpd = sqlUpd % (qty, name)
print(sqlUpd)

rp = conlite.execute(sqlUpd)
rp.rowcount

UPDATE stocks
SET available_qty = available_qty + -40000
WHERE name = "DCC"

1

### End of buy process to stocks table in sqlite port_lite database

### Begin of Update table dividend in mysql stock database for buy transactions

In [50]:
sql = """
SELECT * 
FROM dividend 
WHERE name = "%s" 
"""
sql = sql % name
print(sql)

dividend = pd.read_sql(sql, const)
dividend.style.format(format_dict)

SELECT *
FROM dividend
WHERE name = "DCC"

In [ ]:
sqlUpd = '''
UPDATE dividend
SET shares = shares + %s
WHERE name = "%s"'''
sqlUpd = sqlUpd % (qty, name)
print(sqlUpd)

rp = const.execute(sqlUpd)
rp.rowcount

### End of Update table dividend in mysql stock database for buy transactions